{
    "HEADER": {
      "HOME": "Home",
      "ABOUT": "About",
      "EXPERIENCE": "Experience",
      "SKILLS": "Skills",
      "CONTACT": "Contact"
    },
    "FOOTER": {
      "CONTACT_INFO": "Contact Information",
      "CONNECT": "Connect With Me",
      "RIGHTS": "All Rights Reserved"
    },
    "HOME": {
      "JOB_TITLE": "Senior Software Engineer",
      "INTRO": "Results-driven and self-motivated Software Engineer with expertise in Enterprise Architecture, Software Design and Development in the FinTech and Banking domains.",
      "CONTACT_ME": "Contact Me",
      "VIEW_WORK": "View My Work",
      "FEATURED_COMPANIES": "Companies I've Worked With",
      "CARD1_TITLE": "Software Development",
      "CARD1_TEXT": "Expertise in scalable, robust backend and frontend systems using .NET, C#, and modern web technologies.",
      "CARD2_TITLE": "Banking & FinTech",
      "CARD2_TEXT": "Specialized in payment systems, card management, and core banking solutions including Temenos T24.",
      "CARD3_TITLE": "Cloud & DevOps",
      "CARD3_TEXT": "Experience with containerization, CI/CD pipelines, and microservices architecture."
    },
    "ABOUT": {
      "TITLE": "About Me",
      "SUBTITLE": "Senior Software Engineer specialized in FinTech and Banking Solutions",
      "DESCRIPTION1": "I am a results-driven and self-motivated Software Engineer with a proven track record of success in delivering innovative solutions across complex and challenging projects. My expertise spans Enterprise Architecture, Software Design and Development, and the Software Development Lifecycle, particularly within the FinTech and Banking domains.",
      "DESCRIPTION2": "With strong interpersonal and communication skills, paired with a passion for technology and problem-solving, I consistently deliver exceptional client outcomes and build systems that meet complex business needs.",
      "EDUCATION": "Education",
      "DEGREE": "Engineering Master's Degree - Computer and Communication Engineering",
      "UNIVERSITY": "Lebanese University - Faculty of Engineering - Branch I - Tripoli, Lebanon",
      "EDU_PERIOD": "September 2015 - July 2020",
      "EDU_DETAILS": "Average: 81/100",
      "LANGUAGES": "Languages",
      "ENGLISH": "English",
      "FRENCH": "French",
      "ARABIC": "Arabic",
      "ADVANCED": "Advanced",
      "FLUENT": "Fluent",
      "NATIVE": "Native Language",
      "CERTIFICATIONS": "Certifications"
    },
    "EXPERIENCE": {
      "TITLE": "Work Experience",
      "SUBTITLE": "My professional journey in software engineering and fintech",
      "KEY_RESPONSIBILITIES": "Key Responsibilities",
      "JOB1_TITLE": "Senior Software Engineer",
      "JOB1_COMPANY": "STC Bank",
      "JOB1_PERIOD": "September 2023 - Present",
      "JOB1_LOCATION": "Saudi Arabia, Riyadh",
      "JOB1_DESCRIPTION": "As a Full-Stack Software Engineer reporting directly to the bank entity, I play a pivotal role in launching and optimizing STC Bank's technology systems, driving innovation, and aligning technical solutions with strategic business goals.",
      "JOB1_RESP1": "Leadership in Development: Spearhead the design, development, and implementation of cutting-edge software solutions.",
      "JOB1_RESP2": "Mentorship and Team Building: Mentor junior engineers, fostering a culture of collaboration and high performance.",
      "JOB1_RESP3": "Strategic Collaboration: Work closely with stakeholders to define project scope, timelines, and deliverables.",
      "JOB1_RESP4": "Architectural Excellence: Drive architectural decisions to build scalable, secure, and efficient software systems.",
      "JOB1_RESP5": "Innovation and Optimization: Assess emerging technologies, frameworks, and tools to enhance development efficiency.",
      "JOB1_RESP6": "Regulatory Compliance: Implement SAMA Central Bank change requests and support certification processes.",
      "JOB1_RESP7": "Payment Gateway Integration: Lead the integration of MPGS and Visa-Cybersource payment gateways.",
      "JOB1_RESP8": "Fraud and Compliance Systems: Design and implement fraud detection and compliance systems.",
      "JOB2_TITLE": "Software Engineer Consultant",
      "JOB2_COMPANY": "eMcREY",
      "JOB2_PERIOD": "June 2020 - September 2023",
      "JOB2_LOCATION": "Saudi Arabia, Riyadh",
      "JOB2_DESCRIPTION": "Served as a Full-Stack Software Engineer Consultant for STCPay, contributing to its digital bank transformation while collaborating with global technology leaders such as Temenos, Murex, MasterCard, and Visa.",
      "JOB2_RESP1": "Core Banking System Integration: Integrated the Temenos T24 Core Banking System with the .NET ecosystem.",
      "JOB2_RESP2": "Legacy System Optimization: Refactored and optimized legacy systems, improving maintainability.",
      "JOB2_RESP3": "Middleware Development: Designed and implemented IBM App Connect flows for seamless integration.",
      "JOB2_RESP4": "Third-Party Partnerships: Led integrations with Musaned, Tamkeen, Western Union, and STC.",
      "JOB2_RESP5": "Mobile Collaboration: Partnered with mobile teams to implement new features for digital banking services.",
      "JOB2_RESP6": "CI/CD Automation: Established CI/CD pipelines on GitLab, streamlining deployment processes.",
      "JOB3_TITLE": "Consultant",
      "JOB3_COMPANY": "Riyadh Bank",
      "JOB3_PERIOD": "During eMcREY Employment",
      "JOB3_LOCATION": "Saudi Arabia, Riyadh",
      "JOB3_DESCRIPTION": "Contributed as a consultant to Riyadh Bank, delivering impactful projects in payment systems and digital banking.",
      "JOB3_RESP1": "Card Management System (CMS): Enhanced CMS and reconciliation systems for operational stability.",
      "JOB3_RESP2": "Feature Development: Contributed to the launch of features like Buy Now, Pay Later (BNPL).",
      "JOB3_RESP3": "Acquiring and Merchant Services: Oversaw acquiring processes, merchant services, and clearing/settlement operations."
    },
    "SKILLS": {
      "TITLE": "Skills & Projects",
      "SUBTITLE": "Technical expertise and projects I've worked on",
      "CATEGORY1": ".NET & C# Technologies",
      "CATEGORY2": "Cloud & Architecture",
      "CATEGORY3": "Databases & Web Technologies",
      "CATEGORY4": "Banking & Payment Systems",
      "PROJECTS_TITLE": "Project Highlights",
      "PROJECT1": "STCPay Digital Wallet - A comprehensive digital wallet solution with multiple payment capabilities",
      "PROJECT2": "STCPay Employee Portal - Internal portal for employee management and operations",
      "PROJECT3": "STC Bank - Core banking systems and integrations for the new STC Bank entity",
      "PROJECT4": "STCPay Compliance System - Regulatory compliance and fraud detection system",
      "PROJECT5": "STCPay Payment Hub System - Centralized payment processing and routing system",
      "PROJECT6": "Payment Gateways Implementation - Integration with multiple payment gateway providers"
    },
    "CONTACT": {
      "TITLE": "Contact Me",
      "SUBTITLE": "Get in touch with me for opportunities, questions, or collaboration",
      "FORM_TITLE": "Send Me a Message",
      "NAME": "Name",
      "EMAIL": "Email",
      "SUBJECT": "Subject",
      "MESSAGE": "Message",
      "SEND": "Send Message",
      "SUCCESS": "Thank you for your message! I'll get back to you soon.",
      "INFO_TITLE": "Contact Information",
      "AVAILABILITY": "Availability",
      "AVAILABILITY_TEXT": "I'm currently open to new opportunities and interesting projects in software engineering, particularly in the FinTech and Banking domains.",
      "EMAIL_ME": "Email Me"
    }
  }