{
    "HEADER": {
      "HOME": "Accueil",
      "ABOUT": "À Propos",
      "EXPERIENCE": "Expérience",
      "SKILLS": "Compétences",
      "CONTACT": "Contact"
    },
    "FOOTER": {
      "CONTACT_INFO": "Coordonnées",
      "CONNECT": "Connectez avec Moi",
      "RIGHTS": "Tous Droits Réservés"
    },
    "HOME": {
      "JOB_TITLE": "Ingénieur Logiciel Senior",
      "INTRO": "Ingénieur logiciel motivé et axé sur les résultats, avec une expertise en architecture d'entreprise, conception et développement de logiciels dans les domaines de la FinTech et de la banque.",
      "CONTACT_ME": "Me Contacter",
      "VIEW_WORK": "Voir Mon Travail",
      "FEATURED_COMPANIES": "Entreprises avec lesquelles j'ai travaillé",
      "CARD1_TITLE": "Développement Logiciel",
      "CARD1_TEXT": "Expertise dans les systèmes backend et frontend évolutifs et robustes utilisant .NET, C# et technologies web modernes.",
      "CARD2_TITLE": "Banque & FinTech",
      "CARD2_TEXT": "Spécialisé dans les systèmes de paiement, la gestion des cartes et les solutions bancaires principales, y compris Temenos T24.",
      "CARD3_TITLE": "Cloud & DevOps",
      "CARD3_TEXT": "Expérience avec la conteneurisation, les pipelines CI/CD et l'architecture de microservices."
    },
    "ABOUT": {
      "TITLE": "À Propos de Moi",
      "SUBTITLE": "Ingénieur Logiciel Senior spécialisé dans les Solutions FinTech et Bancaires",
      "DESCRIPTION1": "Je suis un ingénieur logiciel motivé et axé sur les résultats avec un historique avéré de succès dans la livraison de solutions innovantes à travers des projets complexes et exigeants. Mon expertise s'étend à l'architecture d'entreprise, la conception et le développement de logiciels, et le cycle de vie du développement logiciel, particulièrement dans les domaines de la FinTech et de la banque.",
      "DESCRIPTION2": "Avec de solides compétences interpersonnelles et de communication, associées à une passion pour la technologie et la résolution de problèmes, je livre constamment des résultats exceptionnels aux clients et construis des systèmes qui répondent aux besoins commerciaux complexes.",
      "EDUCATION": "Éducation",
      "DEGREE": "Diplôme d'Ingénieur en Génie Informatique et Communication",
      "UNIVERSITY": "Université Libanaise - Faculté d'Ingénierie - Branche I - Tripoli, Liban",
      "EDU_PERIOD": "Septembre 2015 - Juillet 2020",
      "EDU_DETAILS": "Moyenne: 81/100",
      "LANGUAGES": "Langues",
      "ENGLISH": "Anglais",
      "FRENCH": "Français",
      "ARABIC": "Arabe",
      "ADVANCED": "Avancé",
      "FLUENT": "Courant",
      "NATIVE": "Langue Maternelle",
      "CERTIFICATIONS": "Certifications"
    },
    "EXPERIENCE": {
      "TITLE": "Expérience Professionnelle",
      "SUBTITLE": "Mon parcours professionnel en ingénierie logicielle et fintech",
      "KEY_RESPONSIBILITIES": "Responsabilités Principales",
      "JOB1_TITLE": "Ingénieur Logiciel Senior",
      "JOB1_COMPANY": "STC Bank",
      "JOB1_PERIOD": "Septembre 2023 - Présent",
      "JOB1_LOCATION": "Arabie Saoudite, Riyad",
      "JOB1_DESCRIPTION": "En tant qu'ingénieur logiciel Full-Stack rapportant directement à l'entité bancaire, je joue un rôle central dans le lancement et l'optimisation des systèmes technologiques de STC Bank, en favorisant l'innovation et en alignant les solutions techniques avec les objectifs stratégiques de l'entreprise.",
      "JOB1_RESP1": "Leadership en Développement: Diriger la conception, le développement et l'implémentation de solutions logicielles de pointe.",
      "JOB1_RESP2": "Mentorat et Formation d'Équipe: Former les ingénieurs juniors, en favorisant une culture de collaboration et de haute performance.",
      "JOB1_RESP3": "Collaboration Stratégique: Travailler étroitement avec les parties prenantes pour définir la portée, les délais et les livrables des projets.",
      "JOB1_RESP4": "Excellence Architecturale: Diriger les décisions architecturales pour construire des systèmes logiciels évolutifs, sécurisés et efficaces.",
      "JOB1_RESP5": "Innovation et Optimisation: Évaluer les technologies, frameworks et outils émergents pour améliorer l'efficacité du développement.",
      "JOB1_RESP6": "Conformité Réglementaire: Mettre en œuvre les demandes de modification de la Banque Centrale SAMA et soutenir les processus de certification.",
      "JOB1_RESP7": "Intégration de Passerelles de Paiement: Diriger l'intégration des passerelles de paiement MPGS et Visa-Cybersource.",
      "JOB1_RESP8": "Systèmes de Fraude et de Conformité: Concevoir et mettre en œuvre des systèmes de détection de fraude et de conformité.",
      "JOB2_TITLE": "Consultant Ingénieur Logiciel",
      "JOB2_COMPANY": "eMcREY",
      "JOB2_PERIOD": "Juin 2020 - Septembre 2023",
      "JOB2_LOCATION": "Arabie Saoudite, Riyad",
      "JOB2_DESCRIPTION": "J'ai travaillé comme consultant ingénieur logiciel Full-Stack pour STCPay, contribuant à sa transformation en banque numérique tout en collaborant avec des leaders technologiques mondiaux comme Temenos, Murex, MasterCard et Visa.",
      "JOB2_RESP1": "Intégration du Système Bancaire Principal: Intégration du système bancaire principal Temenos T24 avec l'écosystème .NET.",
      "JOB2_RESP2": "Optimisation des Systèmes Hérités: Refactorisation et optimisation des systèmes hérités, améliorant la maintenabilité.",
      "JOB2_RESP3": "Développement de Middleware: Conception et implémentation des flux IBM App Connect pour une intégration transparente.",
      "JOB2_RESP4": "Partenariats Tiers: Direction des intégrations avec Musaned, Tamkeen, Western Union et STC.",
      "JOB2_RESP5": "Collaboration Mobile: Partenariat avec les équipes mobiles pour implémenter de nouvelles fonctionnalités pour les services bancaires numériques.",
      "JOB2_RESP6": "Automatisation CI/CD: Établissement de pipelines CI/CD sur GitLab, rationalisant les processus de déploiement.",
      "JOB3_TITLE": "Consultant",
      "JOB3_COMPANY": "Riyadh Bank",
      "JOB3_PERIOD": "Pendant l'emploi chez eMcREY",
      "JOB3_LOCATION": "Arabie Saoudite, Riyad",
      "JOB3_DESCRIPTION": "J'ai contribué en tant que consultant à Riyadh Bank, livrant des projets impactants dans les systèmes de paiement et la banque numérique.",
      "JOB3_RESP1": "Système de Gestion des Cartes (CMS): Amélioration du CMS et des systèmes de rapprochement pour la stabilité opérationnelle.",
      "JOB3_RESP2": "Développement de Fonctionnalités: Contribution au lancement de fonctionnalités comme Acheter Maintenant, Payer Plus Tard (BNPL).",
      "JOB3_RESP3": "Services d'Acquisition et de Marchands: Supervision des processus d'acquisition, des services marchands et des opérations de clearing/règlement."
    },
    "SKILLS": {
      "TITLE": "Compétences & Projets",
      "SUBTITLE": "Expertise technique et projets sur lesquels j'ai travaillé",
      "CATEGORY1": "Technologies .NET & C#",
      "CATEGORY2": "Cloud & Architecture",
      "CATEGORY3": "Bases de Données & Technologies Web",
      "CATEGORY4": "Systèmes Bancaires & de Paiement",
      "PROJECTS_TITLE": "Points Forts des Projets",
      "PROJECT1": "STCPay Digital Wallet - Une solution complète de portefeuille numérique avec plusieurs capacités de paiement",
      "PROJECT2": "STCPay Employee Portal - Portail interne pour la gestion et les opérations des employés",
      "PROJECT3": "STC Bank - Systèmes bancaires principaux et intégrations pour la nouvelle entité STC Bank",
      "PROJECT4": "STCPay Compliance System - Système de conformité réglementaire et de détection de fraude",
      "PROJECT5": "STCPay Payment Hub System - Système centralisé de traitement et d'acheminement des paiements",
      "PROJECT6": "Implémentation de Passerelles de Paiement - Intégration avec plusieurs fournisseurs de passerelles de paiement"
    },
    "CONTACT": {
      "TITLE": "Me Contacter",
      "SUBTITLE": "Contactez-moi pour des opportunités, des questions ou des collaborations",
      "FORM_TITLE": "Envoyez-moi un Message",
      "NAME": "Nom",
      "EMAIL": "Email",
      "SUBJECT": "Sujet",
      "MESSAGE": "Message",
      "SEND": "Envoyer le Message",
      "SUCCESS": "Merci pour votre message! Je vous répondrai bientôt.",
      "FAIL": "Une erreur s'est produite. Veuillez réessayer plus tard.",
      "INFO_TITLE": "Coordonnées",
      "AVAILABILITY": "Disponibilité",
      "AVAILABILITY_TEXT": "Je suis actuellement ouvert à de nouvelles opportunités et projets intéressants en ingénierie logicielle, particulièrement dans les domaines de la FinTech et de la Banque.",
      "EMAIL_ME": "M'envoyer un Email"
    }
  }